import pandas as pd

In [4]:
df = pd.read_csv('aug_train.csv')

# how big is your data

In [5]:
df.shape

(19158, 14)

# how does the data look like

In [9]:
df.sample(5)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
15421,25754,city_73,0.754,Female,Has relevent experience,Part time course,Graduate,STEM,6,50-99,Pvt Ltd,2,105,0.0
7458,9179,city_48,0.493,NaN,No relevent experience,no_enrollment,Graduate,STEM,2,NaN,NaN,1,23,0.0
8852,13749,city_114,0.926,Male,Has relevent experience,no_enrollment,Masters,Humanities,>20,<10,Pvt Ltd,4,26,1.0
5389,6370,city_103,0.920,NaN,Has relevent experience,Part time course,Graduate,STEM,1,50-99,Funded Startup,1,117,0.0
15806,2065,city_77,0.830,Male,Has relevent experience,no_enrollment,Graduate,STEM,16,50-99,NaN,1,56,0.0

# what is the data type of cols?

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
 13  target                  19158 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 2.0+ MB

# are there any missing values?

In [12]:
df.isnull().sum()

enrollee_id                  0
city                         0
city_development_index       0
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
last_new_job               423
training_hours               0
target                       0
dtype: int64

# how does the data look mathematically?

In [13]:
df.describe()

        enrollee_id  city_development_index  training_hours        target
count  19158.000000            19158.000000    19158.000000  19158.000000
mean   16875.358179                0.828848       65.366896      0.249348
std     9616.292592                0.123362       60.058462      0.432647
min        1.000000                0.448000        1.000000      0.000000
25%     8554.250000                0.740000       23.000000      0.000000
50%    16982.500000                0.903000       47.000000      0.000000
75%    25169.750000                0.920000       88.000000      0.000000
max    33380.000000                0.949000      336.000000      1.000000

# are there duplicate values?

In [14]:
df.duplicated().sum()

0

# how is the correction between cols?

In [16]:
df.corr()

ValueError: could not convert string to float: 'city_103'